# AreValidMembers Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MechanicalEquipmentSet..::..AreValidMembers Method
MechanicalEquipmentSet Class See Also
---
Checks if these are valid members for mechanical equipment set.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public static bool AreValidMembers(
	Document document,
	ISet<ElementId> memberIds
)
```

Visual Basic
---
```text
Public Shared Function AreValidMembers ( _
	document As Document, _
	memberIds As ISet(Of ElementId) _
) As Boolean
```

Visual C++
---
```text
public:
static bool AreValidMembers(
	Document^ document,
	ISet<ElementId^>^ memberIds
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document of the member elements.
memberIds
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)> The member element ids.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace